RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_esc_regs.h
/*
 * ELP1 (RO)
 *
 * Enhanced Link port 1:
 * 0:disabled (if bit 1=0)
 * 1:enabled
 */
#define ESC_ESC_CFG_ELP1_MASK (0x20U)
#define ESC_ESC_CFG_ELP1_SHIFT (5U)
#define ESC_ESC_CFG_ELP1_GET(x) (((uint8_t)(x) & ESC_ESC_CFG_ELP1_MASK) >> ESC_ESC_CFG_ELP1_SHIFT)

/*
 * ELP0 (RO)
 *
 * Enhanced Link port 0:
 * 0:disabled (if bit 1=0)
 * 1:enabled
 */
#define ESC_ESC_CFG_ELP0_MASK (0x10U)
#define ESC_ESC_CFG_ELP0_SHIFT (4U)
#define ESC_ESC_CFG_ELP0_GET(x) (((uint8_t)(x) & ESC_ESC_CFG_ELP0_MASK) >> ESC_ESC_CFG_ELP0_SHIFT)

/*
 * CDLIU (RO)
 *
 * Distributed Clocks Latch In Unit:
 * 0:disabled (power saving)
 * 1:enabled
 */
#define ESC_ESC_CFG_CDLIU_MASK (0x8U)
#define ESC_ESC_CFG_CDLIU_SHIFT (3U)
#define ESC_ESC_CFG_CDLIU_GET(x) (((uint8_t)(x) & ESC_ESC_CFG_CDLIU_MASK) >> ESC_ESC_CFG_CDLIU_SHIFT)

/*
 * DCSOU (RO)
 *
 * Distributed Clocks SYNC Out Unit:
 * 0:disabled (power saving)
 * 1:enabled
 */
#define ESC_ESC_CFG_DCSOU_MASK (0x4U)
#define ESC_ESC_CFG_DCSOU_SHIFT (2U)
#define ESC_ESC_CFG_DCSOU_GET(x) (((uint8_t)(x) & ESC_ESC_CFG_DCSOU_MASK) >> ESC_ESC_CFG_DCSOU_SHIFT)

/*
 * ELDAP (RO)
 *
 * Enhanced Link detection all ports:
 * 0:disabled (if bits [7:4]=0)
 * 1:enabled at all ports (overrides bits [7:4])
 */
#define ESC_ESC_CFG_ELDAP_MASK (0x2U)
#define ESC_ESC_CFG_ELDAP_SHIFT (1U)
#define ESC_ESC_CFG_ELDAP_GET(x) (((uint8_t)(x) & ESC_ESC_CFG_ELDAP_MASK) >> ESC_ESC_CFG_ELDAP_SHIFT)

/*
 * DEV_EMU (RO)
 *
 * Device emulation (control of AL status):
 * 0:AL status register has to be set by PDI
 * 1:AL status register will be set to value
 * written to AL control register
 */
#define ESC_ESC_CFG_DEV_EMU_MASK (0x1U)
#define ESC_ESC_CFG_DEV_EMU_SHIFT (0U)
#define ESC_ESC_CFG_DEV_EMU_GET(x) (((uint8_t)(x) & ESC_ESC_CFG_DEV_EMU_MASK) >> ESC_ESC_CFG_DEV_EMU_SHIFT)

/* Bitfield definition for register: PDI_INFO */
/*
 * PDICN (RO)
 *
 * PDI configuration invalid:
 * 0:PDI configuration ok
 * 1:PDI configuration invalid
 */
#define ESC_PDI_INFO_PDICN_MASK (0x8U)
#define ESC_PDI_INFO_PDICN_SHIFT (3U)
#define ESC_PDI_INFO_PDICN_GET(x) (((uint16_t)(x) & ESC_PDI_INFO_PDICN_MASK) >> ESC_PDI_INFO_PDICN_SHIFT)

/*
 * PDIA (RO)
 *
 * PDI active:
 * 0:PDI not active
 * 1:PDI active
 */
#define ESC_PDI_INFO_PDIA_MASK (0x4U)
#define ESC_PDI_INFO_PDIA_SHIFT (2U)
#define ESC_PDI_INFO_PDIA_GET(x) (((uint16_t)(x) & ESC_PDI_INFO_PDIA_MASK) >> ESC_PDI_INFO_PDIA_SHIFT)

/*
 * ECLFE (RO)
 *
 * ESC configuration area loaded from
 * EEPROM:
 * 0:not loaded
 * 1:loaded
 */
#define ESC_PDI_INFO_ECLFE_MASK (0x2U)
#define ESC_PDI_INFO_ECLFE_SHIFT (1U)
#define ESC_PDI_INFO_ECLFE_GET(x) (((uint16_t)(x) & ESC_PDI_INFO_ECLFE_MASK) >> ESC_PDI_INFO_ECLFE_SHIFT)

/*
 * PFABW (RO)
 *
 * DI function acknowledge by write:
 * 0:Disabled
 * 1:Enabled
 */
#define ESC_PDI_INFO_PFABW_MASK (0x1U)
#define ESC_PDI_INFO_PFABW_SHIFT (0U)
#define ESC_PDI_INFO_PFABW_GET(x) (((uint16_t)(x) & ESC_PDI_INFO_PFABW_MASK) >> ESC_PDI_INFO_PFABW_SHIFT)

/* Bitfield definition for register: PDI_CFG */
/*
 * BUS (RO)
 *
 * On-chip bus:
 * 000:Intel® Avalon®
 * 001:AXI®
 * 010:Xilinx® PLB v4.6
 * 100:Xilinx OPB
 * others:reserved
 */
#define ESC_PDI_CFG_BUS_MASK (0xE0U)
#define ESC_PDI_CFG_BUS_SHIFT (5U)
#define ESC_PDI_CFG_BUS_GET(x) (((uint8_t)(x) & ESC_PDI_CFG_BUS_MASK) >> ESC_PDI_CFG_BUS_SHIFT)

/*
 * CLK (RO)
 *
 * On-chip bus clock:
 * 0:asynchronous
 * 1-31:synchronous multiplication factor
 * (N * 25 MHz)
 */
#define ESC_PDI_CFG_CLK_MASK (0x1FU)
#define ESC_PDI_CFG_CLK_SHIFT (0U)
#define ESC_PDI_CFG_CLK_GET(x) (((uint8_t)(x) & ESC_PDI_CFG_CLK_MASK) >> ESC_PDI_CFG_CLK_SHIFT)

/* Bitfield definition for register: PDI_SL_CFG */
/*
 * SYNC1_MAER (RO)
 *
 * SYNC1 mapped to AL Event Request
 * register 0x0220[3]:
 * 0:Disabled
 * 1:Enabled
 */
#define ESC_PDI_SL_CFG_SYNC1_MAER_MASK (0x80U)
#define ESC_PDI_SL_CFG_SYNC1_MAER_SHIFT (7U)
#define ESC_PDI_SL_CFG_SYNC1_MAER_GET(x) (((uint8_t)(x) & ESC_PDI_SL_CFG_SYNC1_MAER_MASK) >> ESC_PDI_SL_CFG_SYNC1_MAER_SHIFT)

/*
 * SYNC1_CFG (RO)
 *
 * SYNC1/LATCH1 configuration*:
 * 0:LATCH1 input
 * 1:SYNC1 output
 */
#define ESC_PDI_SL_CFG_SYNC1_CFG_MASK (0x40U)
#define ESC_PDI_SL_CFG_SYNC1_CFG_SHIFT (6U)
#define ESC_PDI_SL_CFG_SYNC1_CFG_GET(x) (((uint8_t)(x) & ESC_PDI_SL_CFG_SYNC1_CFG_MASK) >> ESC_PDI_SL_CFG_SYNC1_CFG_SHIFT)

/*
 * SYNC1_ODP (RO)
 *
 * SYNC1 output driver/polarity:
 * 00:Push-Pull active low
 * 01:Open Drain (active low)
 * 10:Push-Pull active high
 * 11:Open Source (active high)
 */
#define ESC_PDI_SL_CFG_SYNC1_ODP_MASK (0x30U)
#define ESC_PDI_SL_CFG_SYNC1_ODP_SHIFT (4U)
#define ESC_PDI_SL_CFG_SYNC1_ODP_GET(x) (((uint8_t)(x) & ESC_PDI_SL_CFG_SYNC1_ODP_MASK) >> ESC_PDI_SL_CFG_SYNC1_ODP_SHIFT)

/*
 * SYNC0_MAER (RO)
 *
 * SYNC0 mapped to AL Event Request
 * register 0x0220[2]:
 * 0:Disabled
 * 1:Enabled
 */
#define ESC_PDI_SL_CFG_SYNC0_MAER_MASK (0x8U)
#define ESC_PDI_SL_CFG_SYNC0_MAER_SHIFT (3U)
#define ESC_PDI_SL_CFG_SYNC0_MAER_GET(x) (((uint8_t)(x) & ESC_PDI_SL_CFG_SYNC0_MAER_MASK) >> ESC_PDI_SL_CFG_SYNC0_MAER_SHIFT)

/*
 * SYNC0_CFG (RO)
 *
 * SYNC0/LATCH0 configuration*:
 * 0:LATCH0 Input
 * 1:SYNC0 Output
 */
#define ESC_PDI_SL_CFG_SYNC0_CFG_MASK (0x4U)
#define ESC_PDI_SL_CFG_SYNC0_CFG_SHIFT (2U)
#define ESC_PDI_SL_CFG_SYNC0_CFG_GET(x) (((uint8_t)(x) & ESC_PDI_SL_CFG_SYNC0_CFG_MASK) >> ESC_PDI_SL_CFG_SYNC0_CFG_SHIFT)

/*
 * SYNC0_ODP (RO)
 *
 * SYNC0 output driver/polarity:
 * 00:Push-Pull active low
 * 01:Open Drain (active low)
 * 10:Push-Pull active high
 * 11:Open Source (active high)
 */
#define ESC_PDI_SL_CFG_SYNC0_ODP_MASK (0x3U)
#define ESC_PDI_SL_CFG_SYNC0_ODP_SHIFT (0U)
#define ESC_PDI_SL_CFG_SYNC0_ODP_GET(x) (((uint8_t)(x) & ESC_PDI_SL_CFG_SYNC0_ODP_MASK) >> ESC_PDI_SL_CFG_SYNC0_ODP_SHIFT)

/* Bitfield definition for register: PDI_EXT_CFG */
/*
 * OCBST (RW)
 *
 * On-chip bus sub-type for AXI:
 * 000:AXI3
 * 001:AXI4
 * 010:AXI4 LITE
 * others:reserved
 */
#define ESC_PDI_EXT_CFG_OCBST_MASK (0x700U)
#define ESC_PDI_EXT_CFG_OCBST_SHIFT (8U)
#define ESC_PDI_EXT_CFG_OCBST_SET(x) (((uint16_t)(x) << ESC_PDI_EXT_CFG_OCBST_SHIFT) & ESC_PDI_EXT_CFG_OCBST_MASK)
#define ESC_PDI_EXT_CFG_OCBST_GET(x) (((uint16_t)(x) & ESC_PDI_EXT_CFG_OCBST_MASK) >> ESC_PDI_EXT_CFG_OCBST_SHIFT)

