RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_esc_regs.h
/*
 * CMD_ERR (RO)
 *
 * Command error:
 * 0:Last Command was successful
 * 1:Invalid command or write command
 * without Write Enable
 * Cleared by executing a valid command or by
 * writing “00” to Command register bits [9:8].
 */
#define ESC_MII_MNG_CS_CMD_ERR_MASK (0x4000U)
#define ESC_MII_MNG_CS_CMD_ERR_SHIFT (14U)
#define ESC_MII_MNG_CS_CMD_ERR_GET(x) (((uint16_t)(x) & ESC_MII_MNG_CS_CMD_ERR_MASK) >> ESC_MII_MNG_CS_CMD_ERR_SHIFT)

/*
 * RD_ERR (RO)
 *
 * Read error:
 * 0:No read error
 * 1:Read error occurred (PHY or register
 * not available)
 * Cleared by writing to register 0x0511
 */
#define ESC_MII_MNG_CS_RD_ERR_MASK (0x2000U)
#define ESC_MII_MNG_CS_RD_ERR_SHIFT (13U)
#define ESC_MII_MNG_CS_RD_ERR_GET(x) (((uint16_t)(x) & ESC_MII_MNG_CS_RD_ERR_MASK) >> ESC_MII_MNG_CS_RD_ERR_SHIFT)

/*
 * CMD (RW)
 *
 * Command register*:
 * Write:Initiate command.
 * Read:Currently executed command
 * 00:No command/MI idle (clear error bits)
 * 01:Read
 * 10:Write
 * Others:Reserved/invalid command (do not
 * issue)
 */
#define ESC_MII_MNG_CS_CMD_MASK (0x300U)
#define ESC_MII_MNG_CS_CMD_SHIFT (8U)
#define ESC_MII_MNG_CS_CMD_SET(x) (((uint16_t)(x) << ESC_MII_MNG_CS_CMD_SHIFT) & ESC_MII_MNG_CS_CMD_MASK)
#define ESC_MII_MNG_CS_CMD_GET(x) (((uint16_t)(x) & ESC_MII_MNG_CS_CMD_MASK) >> ESC_MII_MNG_CS_CMD_SHIFT)

/*
 * PHY_ADDR (RO)
 *
 * PHY address of port 0
 * (this is equal to the PHY address offset, if the
 * PHY addresses are consecutive)
 * IP Core since V3.0.0/3.00c:
 * Translation 0x0512[7]=0:
 * Register 0x0510[7:3] shows PHY address of
 * port 0
 * Translation 0x0512[7]=1:
 * Register 0x0510[7:3] shows the PHY address
 * which will be used for port 0-3 as requested
 * by 0x0512[4:0] (valid values 0-3)
 */
#define ESC_MII_MNG_CS_PHY_ADDR_MASK (0xF8U)
#define ESC_MII_MNG_CS_PHY_ADDR_SHIFT (3U)
#define ESC_MII_MNG_CS_PHY_ADDR_GET(x) (((uint16_t)(x) & ESC_MII_MNG_CS_PHY_ADDR_MASK) >> ESC_MII_MNG_CS_PHY_ADDR_SHIFT)

/*
 * LINK_DC (RO)
 *
 * MI link detection and configuration:
 * 0:Disabled for all ports
 * 1:Enabled for at least one MII port, refer
 * to PHY Port Status (0x0518 ff.) for
 * details
 */
#define ESC_MII_MNG_CS_LINK_DC_MASK (0x4U)
#define ESC_MII_MNG_CS_LINK_DC_SHIFT (2U)
#define ESC_MII_MNG_CS_LINK_DC_GET(x) (((uint16_t)(x) & ESC_MII_MNG_CS_LINK_DC_MASK) >> ESC_MII_MNG_CS_LINK_DC_SHIFT)

/*
 * PDI (RO)
 *
 * Management Interface can be controlled by
 * PDI (registers 0x0516-0x0517):
 * 0:Only ECAT control
 * 1:PDI control possible
 */
#define ESC_MII_MNG_CS_PDI_MASK (0x2U)
#define ESC_MII_MNG_CS_PDI_SHIFT (1U)
#define ESC_MII_MNG_CS_PDI_GET(x) (((uint16_t)(x) & ESC_MII_MNG_CS_PDI_MASK) >> ESC_MII_MNG_CS_PDI_SHIFT)

/*
 * WEN (RO)
 *
 * Write enable*:
 * 0:Write disabled
 * 1:Write enabled
 * This bit is always 1 if PDI has MI control.
 * ET1100-0000/-0001 exception:
 * Bit is not always 1 if PDI has MI control, and
 * bit is writable by PDI.
 */
#define ESC_MII_MNG_CS_WEN_MASK (0x1U)
#define ESC_MII_MNG_CS_WEN_SHIFT (0U)
#define ESC_MII_MNG_CS_WEN_GET(x) (((uint16_t)(x) & ESC_MII_MNG_CS_WEN_MASK) >> ESC_MII_MNG_CS_WEN_SHIFT)

/* Bitfield definition for register: PHY_ADDR */
/*
 * SHOW (RW)
 *
 * Target PHY Address translation:
 * 0:Enabled
 * 1:Disabled
 * Refer to 0x0512[4:0] and 0x0510[7:3] for
 * details.
 */
#define ESC_PHY_ADDR_SHOW_MASK (0x80U)
#define ESC_PHY_ADDR_SHOW_SHIFT (7U)
#define ESC_PHY_ADDR_SHOW_SET(x) (((uint8_t)(x) << ESC_PHY_ADDR_SHOW_SHIFT) & ESC_PHY_ADDR_SHOW_MASK)
#define ESC_PHY_ADDR_SHOW_GET(x) (((uint8_t)(x) & ESC_PHY_ADDR_SHOW_MASK) >> ESC_PHY_ADDR_SHOW_SHIFT)

/*
 * ADDR (RW)
 *
 * Target PHY Address
 * Translation 0x0512[7]=0:
 * 0-3:Target PHY Addresses 0-3 are used
 * to access the PHYs at port 0-3, when
 * the PHY addresses are properly
 * configured
 * 4-31:The configured PHY address of port 0
 * (PHY address offset) is added to the
 * Target PHY Address values 4-31
 * when accessing a PHY
 * Translation 0x0512[7]=1:
 * 0-31:Target PHY Addresses is used when
 * accessing a PHY without translation
 */
#define ESC_PHY_ADDR_ADDR_MASK (0x1FU)
#define ESC_PHY_ADDR_ADDR_SHIFT (0U)
#define ESC_PHY_ADDR_ADDR_SET(x) (((uint8_t)(x) << ESC_PHY_ADDR_ADDR_SHIFT) & ESC_PHY_ADDR_ADDR_MASK)
#define ESC_PHY_ADDR_ADDR_GET(x) (((uint8_t)(x) & ESC_PHY_ADDR_ADDR_MASK) >> ESC_PHY_ADDR_ADDR_SHIFT)

/* Bitfield definition for register: PHY_REG_ADDR */
/*
 * ADDR (RW)
 *
 * Address of PHY Register that shall be
 * read/written
 */
#define ESC_PHY_REG_ADDR_ADDR_MASK (0x1FU)
#define ESC_PHY_REG_ADDR_ADDR_SHIFT (0U)
#define ESC_PHY_REG_ADDR_ADDR_SET(x) (((uint8_t)(x) << ESC_PHY_REG_ADDR_ADDR_SHIFT) & ESC_PHY_REG_ADDR_ADDR_MASK)
#define ESC_PHY_REG_ADDR_ADDR_GET(x) (((uint8_t)(x) & ESC_PHY_REG_ADDR_ADDR_MASK) >> ESC_PHY_REG_ADDR_ADDR_SHIFT)

/* Bitfield definition for register: PHY_DATA */
/*
 * DATA (RW)
 *
 * PHY Read/Write Data
 */
#define ESC_PHY_DATA_DATA_MASK (0xFFFFU)
#define ESC_PHY_DATA_DATA_SHIFT (0U)
#define ESC_PHY_DATA_DATA_SET(x) (((uint16_t)(x) << ESC_PHY_DATA_DATA_SHIFT) & ESC_PHY_DATA_DATA_MASK)
#define ESC_PHY_DATA_DATA_GET(x) (((uint16_t)(x) & ESC_PHY_DATA_DATA_MASK) >> ESC_PHY_DATA_DATA_SHIFT)

/* Bitfield definition for register: MIIM_ECAT_ACC_STAT */
/*
 * ACC (RO)
 *
 * Access to MII management:
 * 0:ECAT enables PDI takeover of MII
 * management interface
 * 1:ECAT claims exclusive access to MII
 * management interface
 */
#define ESC_MIIM_ECAT_ACC_STAT_ACC_MASK (0x1U)
#define ESC_MIIM_ECAT_ACC_STAT_ACC_SHIFT (0U)
#define ESC_MIIM_ECAT_ACC_STAT_ACC_GET(x) (((uint8_t)(x) & ESC_MIIM_ECAT_ACC_STAT_ACC_MASK) >> ESC_MIIM_ECAT_ACC_STAT_ACC_SHIFT)

/* Bitfield definition for register: MIIM_PDI_ACC_STAT */
/*
 * FORCE (RO)
 *
 * Force PDI Access State:
 * 0:Do not change Bit 0x0517[0]
 * 1:Reset Bit 0x0517[0] to 0
 */
#define ESC_MIIM_PDI_ACC_STAT_FORCE_MASK (0x2U)
#define ESC_MIIM_PDI_ACC_STAT_FORCE_SHIFT (1U)
#define ESC_MIIM_PDI_ACC_STAT_FORCE_GET(x) (((uint8_t)(x) & ESC_MIIM_PDI_ACC_STAT_FORCE_MASK) >> ESC_MIIM_PDI_ACC_STAT_FORCE_SHIFT)

/*
 * ACC (RW)
 *
 * Access to MII management:
 * 0:ECAT has access to MII management
 * 1:PDI has access to MII management
 */
#define ESC_MIIM_PDI_ACC_STAT_ACC_MASK (0x1U)
#define ESC_MIIM_PDI_ACC_STAT_ACC_SHIFT (0U)
#define ESC_MIIM_PDI_ACC_STAT_ACC_SET(x) (((uint8_t)(x) << ESC_MIIM_PDI_ACC_STAT_ACC_SHIFT) & ESC_MIIM_PDI_ACC_STAT_ACC_MASK)
#define ESC_MIIM_PDI_ACC_STAT_ACC_GET(x) (((uint8_t)(x) & ESC_MIIM_PDI_ACC_STAT_ACC_MASK) >> ESC_MIIM_PDI_ACC_STAT_ACC_SHIFT)

/* Bitfield definition for register array: PHY_STAT */
/*
 * PCU (RW)
 *
 * PHY configuration updated:
 * 0:No update
 * 1:PHY configuration was updated
 * Cleared by writing any value to at least one
 * of the PHY Port y Status registers.
 */
#define ESC_PHY_STAT_PCU_MASK (0x20U)
#define ESC_PHY_STAT_PCU_SHIFT (5U)
#define ESC_PHY_STAT_PCU_SET(x) (((uint8_t)(x) << ESC_PHY_STAT_PCU_SHIFT) & ESC_PHY_STAT_PCU_MASK)
#define ESC_PHY_STAT_PCU_GET(x) (((uint8_t)(x) & ESC_PHY_STAT_PCU_MASK) >> ESC_PHY_STAT_PCU_SHIFT)

