RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_esc_regs.h
/*
 * LPE (RO)
 *
 * Link partner error:
 * 0:No error detected
 * 1:Link partner error
 */
#define ESC_PHY_STAT_LPE_MASK (0x10U)
#define ESC_PHY_STAT_LPE_SHIFT (4U)
#define ESC_PHY_STAT_LPE_GET(x) (((uint8_t)(x) & ESC_PHY_STAT_LPE_MASK) >> ESC_PHY_STAT_LPE_SHIFT)

/*
 * RE (RW)
 *
 * Read error:
 * 0:No read error occurred
 * 1:A read error has occurred
 * Cleared by writing any value to at least one
 * of the PHY Port y Status registers.
 */
#define ESC_PHY_STAT_RE_MASK (0x8U)
#define ESC_PHY_STAT_RE_SHIFT (3U)
#define ESC_PHY_STAT_RE_SET(x) (((uint8_t)(x) << ESC_PHY_STAT_RE_SHIFT) & ESC_PHY_STAT_RE_MASK)
#define ESC_PHY_STAT_RE_GET(x) (((uint8_t)(x) & ESC_PHY_STAT_RE_MASK) >> ESC_PHY_STAT_RE_SHIFT)

/*
 * LSE (RO)
 *
 * Link status error:
 * 0:No error
 * 1:Link error, link inhibited
 */
#define ESC_PHY_STAT_LSE_MASK (0x4U)
#define ESC_PHY_STAT_LSE_SHIFT (2U)
#define ESC_PHY_STAT_LSE_GET(x) (((uint8_t)(x) & ESC_PHY_STAT_LSE_MASK) >> ESC_PHY_STAT_LSE_SHIFT)

/*
 * LS (RO)
 *
 * Link status (100 Mbit/s, Full Duplex, Auto
 * negotiation):
 * 0:No link
 * 1:Link detected
 */
#define ESC_PHY_STAT_LS_MASK (0x2U)
#define ESC_PHY_STAT_LS_SHIFT (1U)
#define ESC_PHY_STAT_LS_GET(x) (((uint8_t)(x) & ESC_PHY_STAT_LS_MASK) >> ESC_PHY_STAT_LS_SHIFT)

/*
 * PLS (RO)
 *
 * Physical link status (PHY status register 1.2):
 * 0:No physical link
 * 1:Physical link detected
 */
#define ESC_PHY_STAT_PLS_MASK (0x1U)
#define ESC_PHY_STAT_PLS_SHIFT (0U)
#define ESC_PHY_STAT_PLS_GET(x) (((uint8_t)(x) & ESC_PHY_STAT_PLS_MASK) >> ESC_PHY_STAT_PLS_SHIFT)

/* Bitfield definition for register of struct array FMMU: LOGIC_START_ADDR */
/*
 * ADDR (RO)
 *
 * Logical start address within the EtherCAT
 * Address Space.
 */
#define ESC_FMMU_LOGIC_START_ADDR_ADDR_MASK (0xFFFFFFFFUL)
#define ESC_FMMU_LOGIC_START_ADDR_ADDR_SHIFT (0U)
#define ESC_FMMU_LOGIC_START_ADDR_ADDR_GET(x) (((uint32_t)(x) & ESC_FMMU_LOGIC_START_ADDR_ADDR_MASK) >> ESC_FMMU_LOGIC_START_ADDR_ADDR_SHIFT)

/* Bitfield definition for register of struct array FMMU: LENGTH */
/*
 * OFFSET (RO)
 *
 * Offset from the first logical FMMU byte to the
 * last FMMU byte + 1 (e.g., if two bytes are
 * used, then this parameter shall contain 2)
 */
#define ESC_FMMU_LENGTH_OFFSET_MASK (0xFFFFU)
#define ESC_FMMU_LENGTH_OFFSET_SHIFT (0U)
#define ESC_FMMU_LENGTH_OFFSET_GET(x) (((uint16_t)(x) & ESC_FMMU_LENGTH_OFFSET_MASK) >> ESC_FMMU_LENGTH_OFFSET_SHIFT)

/* Bitfield definition for register of struct array FMMU: LOGIC_START_BIT */
/*
 * START (RO)
 *
 * Logical starting bit that shall be mapped (bits
 * are counted from least significant bit 0 to
 * most significant bit 7)
 */
#define ESC_FMMU_LOGIC_START_BIT_START_MASK (0x7U)
#define ESC_FMMU_LOGIC_START_BIT_START_SHIFT (0U)
#define ESC_FMMU_LOGIC_START_BIT_START_GET(x) (((uint8_t)(x) & ESC_FMMU_LOGIC_START_BIT_START_MASK) >> ESC_FMMU_LOGIC_START_BIT_START_SHIFT)

/* Bitfield definition for register of struct array FMMU: LOGIC_STOP_BIT */
/*
 * STOP (RO)
 *
 * Last logical bit that shall be mapped (bits are
 * counted from least significant bit 0 to most
 * significant bit 7)
 */
#define ESC_FMMU_LOGIC_STOP_BIT_STOP_MASK (0x7U)
#define ESC_FMMU_LOGIC_STOP_BIT_STOP_SHIFT (0U)
#define ESC_FMMU_LOGIC_STOP_BIT_STOP_GET(x) (((uint8_t)(x) & ESC_FMMU_LOGIC_STOP_BIT_STOP_MASK) >> ESC_FMMU_LOGIC_STOP_BIT_STOP_SHIFT)

/* Bitfield definition for register of struct array FMMU: PHYSICAL_START_ADDR */
/*
 * ADDR (RO)
 *
 * Physical Start Address (mapped to logical
 * Start address)
 */
#define ESC_FMMU_PHYSICAL_START_ADDR_ADDR_MASK (0xFFFFU)
#define ESC_FMMU_PHYSICAL_START_ADDR_ADDR_SHIFT (0U)
#define ESC_FMMU_PHYSICAL_START_ADDR_ADDR_GET(x) (((uint16_t)(x) & ESC_FMMU_PHYSICAL_START_ADDR_ADDR_MASK) >> ESC_FMMU_PHYSICAL_START_ADDR_ADDR_SHIFT)

/* Bitfield definition for register of struct array FMMU: PHYSICAL_START_BIT */
/*
 * START (RO)
 *
 * Physical starting bit as target of logical start
 * bit mapping (bits are counted from least
 * significant bit 0 to most significant bit 7)
 */
#define ESC_FMMU_PHYSICAL_START_BIT_START_MASK (0x7U)
#define ESC_FMMU_PHYSICAL_START_BIT_START_SHIFT (0U)
#define ESC_FMMU_PHYSICAL_START_BIT_START_GET(x) (((uint8_t)(x) & ESC_FMMU_PHYSICAL_START_BIT_START_MASK) >> ESC_FMMU_PHYSICAL_START_BIT_START_SHIFT)

/* Bitfield definition for register of struct array FMMU: TYPE */
/*
 * MAP_WR (RO)
 *
 * 0:Ignore mapping for write accesses
 * 1:Use mapping for write accesses
 */
#define ESC_FMMU_TYPE_MAP_WR_MASK (0x2U)
#define ESC_FMMU_TYPE_MAP_WR_SHIFT (1U)
#define ESC_FMMU_TYPE_MAP_WR_GET(x) (((uint8_t)(x) & ESC_FMMU_TYPE_MAP_WR_MASK) >> ESC_FMMU_TYPE_MAP_WR_SHIFT)

/*
 * MAP_RD (RO)
 *
 * 0:Ignore mapping for read accesses
 * 1:Use mapping for read accesses
 */
#define ESC_FMMU_TYPE_MAP_RD_MASK (0x1U)
#define ESC_FMMU_TYPE_MAP_RD_SHIFT (0U)
#define ESC_FMMU_TYPE_MAP_RD_GET(x) (((uint8_t)(x) & ESC_FMMU_TYPE_MAP_RD_MASK) >> ESC_FMMU_TYPE_MAP_RD_SHIFT)

/* Bitfield definition for register of struct array FMMU: ACTIVATE */
/*
 * ACT (RO)
 *
 * 0:FMMU deactivated
 * 1:FMMU activated. FMMU checks
 * logically addressed blocks to be
 * mapped according to configured
 * mapping
 */
#define ESC_FMMU_ACTIVATE_ACT_MASK (0x1U)
#define ESC_FMMU_ACTIVATE_ACT_SHIFT (0U)
#define ESC_FMMU_ACTIVATE_ACT_GET(x) (((uint8_t)(x) & ESC_FMMU_ACTIVATE_ACT_MASK) >> ESC_FMMU_ACTIVATE_ACT_SHIFT)

/* Bitfield definition for register of struct array SYNCM: PHYSICAL_START_ADDR */
/*
 * ADDR (RO)
 *
 * First byte that will be handled by
 * SyncManager
 */
#define ESC_SYNCM_PHYSICAL_START_ADDR_ADDR_MASK (0xFFFFU)
#define ESC_SYNCM_PHYSICAL_START_ADDR_ADDR_SHIFT (0U)
#define ESC_SYNCM_PHYSICAL_START_ADDR_ADDR_GET(x) (((uint16_t)(x) & ESC_SYNCM_PHYSICAL_START_ADDR_ADDR_MASK) >> ESC_SYNCM_PHYSICAL_START_ADDR_ADDR_SHIFT)

/* Bitfield definition for register of struct array SYNCM: LENGTH */
/*
 * LEN (RO)
 *
 * Number of bytes assigned to SyncManager
 * (shall be greater than 1, otherwise
 * SyncManager is not activated. If set to 1, only
 * Watchdog Trigger is generated if configured)
 */
#define ESC_SYNCM_LENGTH_LEN_MASK (0xFFFFU)
#define ESC_SYNCM_LENGTH_LEN_SHIFT (0U)
#define ESC_SYNCM_LENGTH_LEN_GET(x) (((uint16_t)(x) & ESC_SYNCM_LENGTH_LEN_MASK) >> ESC_SYNCM_LENGTH_LEN_SHIFT)

/* Bitfield definition for register of struct array SYNCM: CONTROL */
/*
 * WDG_TRG_EN (RO)
 *
 * Watchdog Trigger Enable:
 * 0:Disabled
 * 1:Enabled
 */
#define ESC_SYNCM_CONTROL_WDG_TRG_EN_MASK (0x40U)
#define ESC_SYNCM_CONTROL_WDG_TRG_EN_SHIFT (6U)
#define ESC_SYNCM_CONTROL_WDG_TRG_EN_GET(x) (((uint8_t)(x) & ESC_SYNCM_CONTROL_WDG_TRG_EN_MASK) >> ESC_SYNCM_CONTROL_WDG_TRG_EN_SHIFT)

