RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_esc_regs.h
/*
 * INT_AL (RO)
 *
 * Interrupt in AL Event Request Register:
 * 0:Disabled
 * 1:Enabled
 */
#define ESC_SYNCM_CONTROL_INT_AL_MASK (0x20U)
#define ESC_SYNCM_CONTROL_INT_AL_SHIFT (5U)
#define ESC_SYNCM_CONTROL_INT_AL_GET(x) (((uint8_t)(x) & ESC_SYNCM_CONTROL_INT_AL_MASK) >> ESC_SYNCM_CONTROL_INT_AL_SHIFT)

/*
 * INT_ECAT (RO)
 *
 * Interrupt in ECAT Event Request Register:
 * 0:Disabled
 * 1:Enabled
 */
#define ESC_SYNCM_CONTROL_INT_ECAT_MASK (0x10U)
#define ESC_SYNCM_CONTROL_INT_ECAT_SHIFT (4U)
#define ESC_SYNCM_CONTROL_INT_ECAT_GET(x) (((uint8_t)(x) & ESC_SYNCM_CONTROL_INT_ECAT_MASK) >> ESC_SYNCM_CONTROL_INT_ECAT_SHIFT)

/*
 * DIR (RO)
 *
 * Direction:
 * 00:Read:ECAT read access, PDI write
 * access.
 * 01:Write:ECAT write access, PDI read
 * access.
 * 10:Reserved
 * 11:Reserved
 */
#define ESC_SYNCM_CONTROL_DIR_MASK (0xCU)
#define ESC_SYNCM_CONTROL_DIR_SHIFT (2U)
#define ESC_SYNCM_CONTROL_DIR_GET(x) (((uint8_t)(x) & ESC_SYNCM_CONTROL_DIR_MASK) >> ESC_SYNCM_CONTROL_DIR_SHIFT)

/*
 * OP_MODE (RO)
 *
 * Operation Mode:
 * 00:Buffered (3 buffer mode)
 * 01:Reserved
 * 10:Mailbox (Single buffer mode)
 * 11:Reserved
 */
#define ESC_SYNCM_CONTROL_OP_MODE_MASK (0x3U)
#define ESC_SYNCM_CONTROL_OP_MODE_SHIFT (0U)
#define ESC_SYNCM_CONTROL_OP_MODE_GET(x) (((uint8_t)(x) & ESC_SYNCM_CONTROL_OP_MODE_MASK) >> ESC_SYNCM_CONTROL_OP_MODE_SHIFT)

/* Bitfield definition for register of struct array SYNCM: STATUS */
/*
 * WB_INUSE (RO)
 *
 * Write buffer in use (opened)
 */
#define ESC_SYNCM_STATUS_WB_INUSE_MASK (0x80U)
#define ESC_SYNCM_STATUS_WB_INUSE_SHIFT (7U)
#define ESC_SYNCM_STATUS_WB_INUSE_GET(x) (((uint8_t)(x) & ESC_SYNCM_STATUS_WB_INUSE_MASK) >> ESC_SYNCM_STATUS_WB_INUSE_SHIFT)

/*
 * RB_INUSE (RO)
 *
 * Read buffer in use (opened)
 */
#define ESC_SYNCM_STATUS_RB_INUSE_MASK (0x40U)
#define ESC_SYNCM_STATUS_RB_INUSE_SHIFT (6U)
#define ESC_SYNCM_STATUS_RB_INUSE_GET(x) (((uint8_t)(x) & ESC_SYNCM_STATUS_RB_INUSE_MASK) >> ESC_SYNCM_STATUS_RB_INUSE_SHIFT)

/*
 * BUF_MODE (RO)
 *
 * Buffered mode:buffer status (last written
 * buffer):
 * 00:1
 * st buffer
 * 01:2
 * nd buffer
 * 10:3
 * rd buffer
 * 11:(no buffer written)
 * Mailbox mode:reserved
 */
#define ESC_SYNCM_STATUS_BUF_MODE_MASK (0x30U)
#define ESC_SYNCM_STATUS_BUF_MODE_SHIFT (4U)
#define ESC_SYNCM_STATUS_BUF_MODE_GET(x) (((uint8_t)(x) & ESC_SYNCM_STATUS_BUF_MODE_MASK) >> ESC_SYNCM_STATUS_BUF_MODE_SHIFT)

/*
 * MBX_MODE (RO)
 *
 * Mailbox mode:mailbox status:
 * 0:Mailbox empty
 * 1:Mailbox full
 * Buffered mode:reserved
 */
#define ESC_SYNCM_STATUS_MBX_MODE_MASK (0x8U)
#define ESC_SYNCM_STATUS_MBX_MODE_SHIFT (3U)
#define ESC_SYNCM_STATUS_MBX_MODE_GET(x) (((uint8_t)(x) & ESC_SYNCM_STATUS_MBX_MODE_MASK) >> ESC_SYNCM_STATUS_MBX_MODE_SHIFT)

/*
 * INT_RD (RO)
 *
 * Interrupt Read:
 * 1:Interrupt after buffer was completely and
 * successfully read
 * 0:Interrupt cleared after first byte of buffer
 * was written
 * NOTE:This interrupt is signalled to the writing
 * side if enabled in the SM Control register
 */
#define ESC_SYNCM_STATUS_INT_RD_MASK (0x2U)
#define ESC_SYNCM_STATUS_INT_RD_SHIFT (1U)
#define ESC_SYNCM_STATUS_INT_RD_GET(x) (((uint8_t)(x) & ESC_SYNCM_STATUS_INT_RD_MASK) >> ESC_SYNCM_STATUS_INT_RD_SHIFT)

/*
 * INT_WR (RO)
 *
 * Interrupt Write:
 * 1:Interrupt after buffer was completely and
 * successfully written
 * 0:Interrupt cleared after first byte of buffer
 * was read
 * NOTE:This interrupt is signalled to the reading
 * side if enabled in the SM Control register
 */
#define ESC_SYNCM_STATUS_INT_WR_MASK (0x1U)
#define ESC_SYNCM_STATUS_INT_WR_SHIFT (0U)
#define ESC_SYNCM_STATUS_INT_WR_GET(x) (((uint8_t)(x) & ESC_SYNCM_STATUS_INT_WR_MASK) >> ESC_SYNCM_STATUS_INT_WR_SHIFT)

/* Bitfield definition for register of struct array SYNCM: ACTIVATE */
/*
 * LATCH_PDI (RO)
 *
 * Latch Event PDI:
 * 0:No
 * 1:Generate Latch events when PDI issues
 * a buffer exchange or when PDI
 * accesses buffer start address
 */
#define ESC_SYNCM_ACTIVATE_LATCH_PDI_MASK (0x80U)
#define ESC_SYNCM_ACTIVATE_LATCH_PDI_SHIFT (7U)
#define ESC_SYNCM_ACTIVATE_LATCH_PDI_GET(x) (((uint8_t)(x) & ESC_SYNCM_ACTIVATE_LATCH_PDI_MASK) >> ESC_SYNCM_ACTIVATE_LATCH_PDI_SHIFT)

/*
 * LATCH_ECAT (RO)
 *
 * Latch Event ECAT:
 * 0:No
 * 1:Generate Latch event when EtherCAT
 * master issues a buffer exchange
 */
#define ESC_SYNCM_ACTIVATE_LATCH_ECAT_MASK (0x40U)
#define ESC_SYNCM_ACTIVATE_LATCH_ECAT_SHIFT (6U)
#define ESC_SYNCM_ACTIVATE_LATCH_ECAT_GET(x) (((uint8_t)(x) & ESC_SYNCM_ACTIVATE_LATCH_ECAT_MASK) >> ESC_SYNCM_ACTIVATE_LATCH_ECAT_SHIFT)

/*
 * REPEAT (RO)
 *
 * Repeat Request:
 * A toggle of Repeat Request means that a
 * mailbox retry is needed (primarily used in
 * conjunction with ECAT Read Mailbox)
 */
#define ESC_SYNCM_ACTIVATE_REPEAT_MASK (0x2U)
#define ESC_SYNCM_ACTIVATE_REPEAT_SHIFT (1U)
#define ESC_SYNCM_ACTIVATE_REPEAT_GET(x) (((uint8_t)(x) & ESC_SYNCM_ACTIVATE_REPEAT_MASK) >> ESC_SYNCM_ACTIVATE_REPEAT_SHIFT)

/*
 * EN (RW)
 *
 * SyncManager Enable/Disable:
 * 0:Disable:Access to Memory without
 * SyncManager control
 * 1:Enable:SyncManager is active and
 * controls Memory area set in
 * configuration
 */
#define ESC_SYNCM_ACTIVATE_EN_MASK (0x1U)
#define ESC_SYNCM_ACTIVATE_EN_SHIFT (0U)
#define ESC_SYNCM_ACTIVATE_EN_SET(x) (((uint8_t)(x) << ESC_SYNCM_ACTIVATE_EN_SHIFT) & ESC_SYNCM_ACTIVATE_EN_MASK)
#define ESC_SYNCM_ACTIVATE_EN_GET(x) (((uint8_t)(x) & ESC_SYNCM_ACTIVATE_EN_MASK) >> ESC_SYNCM_ACTIVATE_EN_SHIFT)

/* Bitfield definition for register of struct array SYNCM: PDI_CTRL */
/*
 * REPEAT_ACK (RW)
 *
 * Repeat Ack:
 * If this is set to the same value as that set by
 * Repeat Request, the PDI acknowledges the
 * execution of a previous set Repeat request.
 */
#define ESC_SYNCM_PDI_CTRL_REPEAT_ACK_MASK (0x2U)
#define ESC_SYNCM_PDI_CTRL_REPEAT_ACK_SHIFT (1U)
#define ESC_SYNCM_PDI_CTRL_REPEAT_ACK_SET(x) (((uint8_t)(x) << ESC_SYNCM_PDI_CTRL_REPEAT_ACK_SHIFT) & ESC_SYNCM_PDI_CTRL_REPEAT_ACK_MASK)
#define ESC_SYNCM_PDI_CTRL_REPEAT_ACK_GET(x) (((uint8_t)(x) & ESC_SYNCM_PDI_CTRL_REPEAT_ACK_MASK) >> ESC_SYNCM_PDI_CTRL_REPEAT_ACK_SHIFT)

