RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_esc_regs.h
/*
 * DEACT (RW)
 *
 * Deactivate SyncManager:
 * Read:
 * 0:Normal operation, SyncManager
 * activated.
 * 1:SyncManager deactivated and reset.
 * SyncManager locks access to Memory
 * area.
 * Write:
 * 0:Activate SyncManager
 * 1:Request SyncManager deactivation
 * NOTE:Writing 1 is delayed until the end of the
 * frame, which is currently processed.
 */
#define ESC_SYNCM_PDI_CTRL_DEACT_MASK (0x1U)
#define ESC_SYNCM_PDI_CTRL_DEACT_SHIFT (0U)
#define ESC_SYNCM_PDI_CTRL_DEACT_SET(x) (((uint8_t)(x) << ESC_SYNCM_PDI_CTRL_DEACT_SHIFT) & ESC_SYNCM_PDI_CTRL_DEACT_MASK)
#define ESC_SYNCM_PDI_CTRL_DEACT_GET(x) (((uint8_t)(x) & ESC_SYNCM_PDI_CTRL_DEACT_MASK) >> ESC_SYNCM_PDI_CTRL_DEACT_SHIFT)

/* Bitfield definition for register array: RCV_TIME */
/*
 * LT (RO)
 *
 * Local time at the beginning of the last receive
 * frame containing a write access to register
 * 0x0900.
 */
#define ESC_RCV_TIME_LT_MASK (0xFFFFFF00UL)
#define ESC_RCV_TIME_LT_SHIFT (8U)
#define ESC_RCV_TIME_LT_GET(x) (((uint32_t)(x) & ESC_RCV_TIME_LT_MASK) >> ESC_RCV_TIME_LT_SHIFT)

/*
 * REQ (RO)
 *
 * Write:
 * A write access to register 0x0900 with
 * BWR or FPWR latches the local time at
 * the beginning of the receive frame (start
 * first bit of preamble) at each port.
 * Write (ESC20, ET1200 exception):
 * A write access latches the local time at
 * the beginning of the receive frame at
 * port 0. It enables the time stamping at
 * the other ports.
 * Read:
 * Local time at the beginning of the last
 * receive frame containing a write access
 * to this register.
 * NOTE:FPWR requires an address match for
 * accessing this register like any FPWR command.
 * All write commands with address match will
 * increment the working counter (e.g., APWR), but
 * they will not trigger receive time latching.
 */
#define ESC_RCV_TIME_REQ_MASK (0xFFU)
#define ESC_RCV_TIME_REQ_SHIFT (0U)
#define ESC_RCV_TIME_REQ_GET(x) (((uint32_t)(x) & ESC_RCV_TIME_REQ_MASK) >> ESC_RCV_TIME_REQ_SHIFT)

/* Bitfield definition for register: SYS_TIME */
/*
 * ST (RW)
 *
 */
#define ESC_SYS_TIME_ST_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_SYS_TIME_ST_SHIFT (0U)
#define ESC_SYS_TIME_ST_SET(x) (((uint64_t)(x) << ESC_SYS_TIME_ST_SHIFT) & ESC_SYS_TIME_ST_MASK)
#define ESC_SYS_TIME_ST_GET(x) (((uint64_t)(x) & ESC_SYS_TIME_ST_MASK) >> ESC_SYS_TIME_ST_SHIFT)

/* Bitfield definition for register: RCVT_ECAT_PU */
/*
 * LT (RO)
 *
 * Local time at the beginning of a frame (start
 * first bit of preamble) received at the ECAT
 * Processing Unit containing a write access to
 * register 0x0900
 * NOTE:E.g., if port 0 is open, this register reflects
 * the Receive Time Port 0 as a 64 Bit value.
 * Any valid EtherCAT write access to register
 * 0x0900 triggers latching, not only BWR/FPWR
 * commands as with register 0x0900.
 */
#define ESC_RCVT_ECAT_PU_LT_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_RCVT_ECAT_PU_LT_SHIFT (0U)
#define ESC_RCVT_ECAT_PU_LT_GET(x) (((uint64_t)(x) & ESC_RCVT_ECAT_PU_LT_MASK) >> ESC_RCVT_ECAT_PU_LT_SHIFT)

/* Bitfield definition for register: SYS_TIME_OFFSET */
/*
 * OFFSET (RW)
 *
 * Difference between local time and System
 * Time. Offset is added to the local time.
 */
#define ESC_SYS_TIME_OFFSET_OFFSET_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_SYS_TIME_OFFSET_OFFSET_SHIFT (0U)
#define ESC_SYS_TIME_OFFSET_OFFSET_SET(x) (((uint64_t)(x) << ESC_SYS_TIME_OFFSET_OFFSET_SHIFT) & ESC_SYS_TIME_OFFSET_OFFSET_MASK)
#define ESC_SYS_TIME_OFFSET_OFFSET_GET(x) (((uint64_t)(x) & ESC_SYS_TIME_OFFSET_OFFSET_MASK) >> ESC_SYS_TIME_OFFSET_OFFSET_SHIFT)

/* Bitfield definition for register: SYS_TIME_DELAY */
/*
 * DLY (RW)
 *
 * Delay between Reference Clock and the
 * ESC
 */
#define ESC_SYS_TIME_DELAY_DLY_MASK (0xFFFFFFFFUL)
#define ESC_SYS_TIME_DELAY_DLY_SHIFT (0U)
#define ESC_SYS_TIME_DELAY_DLY_SET(x) (((uint32_t)(x) << ESC_SYS_TIME_DELAY_DLY_SHIFT) & ESC_SYS_TIME_DELAY_DLY_MASK)
#define ESC_SYS_TIME_DELAY_DLY_GET(x) (((uint32_t)(x) & ESC_SYS_TIME_DELAY_DLY_MASK) >> ESC_SYS_TIME_DELAY_DLY_SHIFT)

/* Bitfield definition for register: SYS_TIME_DIFF */
/*
 * DIFF (RO)
 *
 * 0:Local copy of System Time less than
 * received System Time
 * 1:Local copy of System Time greater than
 * or equal to received System Time
 */
#define ESC_SYS_TIME_DIFF_DIFF_MASK (0x80000000UL)
#define ESC_SYS_TIME_DIFF_DIFF_SHIFT (31U)
#define ESC_SYS_TIME_DIFF_DIFF_GET(x) (((uint32_t)(x) & ESC_SYS_TIME_DIFF_DIFF_MASK) >> ESC_SYS_TIME_DIFF_DIFF_SHIFT)

/*
 * NUM (RO)
 *
 * Mean difference between local copy of
 * System Time and received System Time
 * values
 * Difference = Received System Time –
 * local copy of System Time
 */
#define ESC_SYS_TIME_DIFF_NUM_MASK (0x7FFFFFFFUL)
#define ESC_SYS_TIME_DIFF_NUM_SHIFT (0U)
#define ESC_SYS_TIME_DIFF_NUM_GET(x) (((uint32_t)(x) & ESC_SYS_TIME_DIFF_NUM_MASK) >> ESC_SYS_TIME_DIFF_NUM_SHIFT)

/* Bitfield definition for register: SPD_CNT_START */
/*
 * BW (RW)
 *
 * Bandwidth for adjustment of local copy of
 * System Time (larger values → smaller
 * bandwidth and smoother adjustment)
 * A write access resets System Time
 * Difference (0x092C:0x092F) and Speed
 * Counter Diff (0x0932:0x0933).
 * Valid values:0x0080 to 0x3FFF
 */
#define ESC_SPD_CNT_START_BW_MASK (0x7FFFU)
#define ESC_SPD_CNT_START_BW_SHIFT (0U)
#define ESC_SPD_CNT_START_BW_SET(x) (((uint16_t)(x) << ESC_SPD_CNT_START_BW_SHIFT) & ESC_SPD_CNT_START_BW_MASK)
#define ESC_SPD_CNT_START_BW_GET(x) (((uint16_t)(x) & ESC_SPD_CNT_START_BW_MASK) >> ESC_SPD_CNT_START_BW_SHIFT)

/* Bitfield definition for register: SPD_CNT_DIFF */
/*
 * DIFF (RO)
 *
 * Representation of the deviation between
 * local clock period and Reference Clock's
 * clock period (representation:two's
 * complement)
 * Range:±(Speed Counter Start – 0x7F)
 */
#define ESC_SPD_CNT_DIFF_DIFF_MASK (0xFFFFU)
#define ESC_SPD_CNT_DIFF_DIFF_SHIFT (0U)
#define ESC_SPD_CNT_DIFF_DIFF_GET(x) (((uint16_t)(x) & ESC_SPD_CNT_DIFF_DIFF_MASK) >> ESC_SPD_CNT_DIFF_DIFF_SHIFT)

/* Bitfield definition for register: SYS_TIME_DIFF_FD */
/*
 * DEPTH (RW)
 *
 * Filter depth for averaging the received
 * System Time deviation
 * IP Core since V2.2.0/V2.02a:
 * A write access resets System Time
 * Difference (0x092C:0x092F)
 */
#define ESC_SYS_TIME_DIFF_FD_DEPTH_MASK (0xFU)
#define ESC_SYS_TIME_DIFF_FD_DEPTH_SHIFT (0U)
#define ESC_SYS_TIME_DIFF_FD_DEPTH_SET(x) (((uint8_t)(x) << ESC_SYS_TIME_DIFF_FD_DEPTH_SHIFT) & ESC_SYS_TIME_DIFF_FD_DEPTH_MASK)
#define ESC_SYS_TIME_DIFF_FD_DEPTH_GET(x) (((uint8_t)(x) & ESC_SYS_TIME_DIFF_FD_DEPTH_MASK) >> ESC_SYS_TIME_DIFF_FD_DEPTH_SHIFT)

/* Bitfield definition for register: SPD_CNT_FD */
/*
 * DEPTH (RW)
 *
 * Filter depth for averaging the clock period
 * deviation
 * IP Core since V2.2.0/V2.02a:
 * A write access resets the internal speed
 * counter filter
 */
#define ESC_SPD_CNT_FD_DEPTH_MASK (0xFU)
#define ESC_SPD_CNT_FD_DEPTH_SHIFT (0U)
#define ESC_SPD_CNT_FD_DEPTH_SET(x) (((uint8_t)(x) << ESC_SPD_CNT_FD_DEPTH_SHIFT) & ESC_SPD_CNT_FD_DEPTH_MASK)
#define ESC_SPD_CNT_FD_DEPTH_GET(x) (((uint8_t)(x) & ESC_SPD_CNT_FD_DEPTH_MASK) >> ESC_SPD_CNT_FD_DEPTH_SHIFT)

