RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_esc_regs.h
/*
 * NEG_EDGE (RO)
 *
 * Event Latch0 negative edge.
 * 0:Negative edge not detected or
 * continuous mode
 * 1:Negative edge detected in single event
 * mode only.
 * Flag cleared by reading out Latch0 Time
 * Negative Edge.
 */
#define ESC_LATCH0_STAT_NEG_EDGE_MASK (0x2U)
#define ESC_LATCH0_STAT_NEG_EDGE_SHIFT (1U)
#define ESC_LATCH0_STAT_NEG_EDGE_GET(x) (((uint8_t)(x) & ESC_LATCH0_STAT_NEG_EDGE_MASK) >> ESC_LATCH0_STAT_NEG_EDGE_SHIFT)

/*
 * POS_EDGE (RO)
 *
 * Event Latch0 positive edge.
 * 0:Positive edge not detected or
 * continuous mode
 * 1:Positive edge detected in single event
 * mode only.
 * Flag cleared by reading out Latch0 Time
 * Positive Edge.
 */
#define ESC_LATCH0_STAT_POS_EDGE_MASK (0x1U)
#define ESC_LATCH0_STAT_POS_EDGE_SHIFT (0U)
#define ESC_LATCH0_STAT_POS_EDGE_GET(x) (((uint8_t)(x) & ESC_LATCH0_STAT_POS_EDGE_MASK) >> ESC_LATCH0_STAT_POS_EDGE_SHIFT)

/* Bitfield definition for register: LATCH1_STAT */
/*
 * PIN_STAT (RO)
 *
 * Latch1 pin state
 */
#define ESC_LATCH1_STAT_PIN_STAT_MASK (0x4U)
#define ESC_LATCH1_STAT_PIN_STAT_SHIFT (2U)
#define ESC_LATCH1_STAT_PIN_STAT_GET(x) (((uint8_t)(x) & ESC_LATCH1_STAT_PIN_STAT_MASK) >> ESC_LATCH1_STAT_PIN_STAT_SHIFT)

/*
 * NEG_EDGE (RO)
 *
 * Event Latch1 negative edge.
 * 0:Negative edge not detected or
 * continuous mode
 * 1:Negative edge detected in single event
 * mode only.
 * Flag cleared by reading out Latch1 Time
 * Negative Edge.
 */
#define ESC_LATCH1_STAT_NEG_EDGE_MASK (0x2U)
#define ESC_LATCH1_STAT_NEG_EDGE_SHIFT (1U)
#define ESC_LATCH1_STAT_NEG_EDGE_GET(x) (((uint8_t)(x) & ESC_LATCH1_STAT_NEG_EDGE_MASK) >> ESC_LATCH1_STAT_NEG_EDGE_SHIFT)

/*
 * POS_EDGE (RO)
 *
 * Event Latch1 positive edge.
 * 0:Positive edge not detected or
 * continuous mode
 * 1:Positive edge detected in single event
 * mode only.
 * Flag cleared by reading out Latch1 Time
 * Positive Edge.
 */
#define ESC_LATCH1_STAT_POS_EDGE_MASK (0x1U)
#define ESC_LATCH1_STAT_POS_EDGE_SHIFT (0U)
#define ESC_LATCH1_STAT_POS_EDGE_GET(x) (((uint8_t)(x) & ESC_LATCH1_STAT_POS_EDGE_MASK) >> ESC_LATCH1_STAT_POS_EDGE_SHIFT)

/* Bitfield definition for register: LATCH0_TIME_PE */
/*
 * TIME (RW)
 *
 * System time at the positive edge of the
 * Latch0 signal.
 */
#define ESC_LATCH0_TIME_PE_TIME_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_LATCH0_TIME_PE_TIME_SHIFT (0U)
#define ESC_LATCH0_TIME_PE_TIME_SET(x) (((uint64_t)(x) << ESC_LATCH0_TIME_PE_TIME_SHIFT) & ESC_LATCH0_TIME_PE_TIME_MASK)
#define ESC_LATCH0_TIME_PE_TIME_GET(x) (((uint64_t)(x) & ESC_LATCH0_TIME_PE_TIME_MASK) >> ESC_LATCH0_TIME_PE_TIME_SHIFT)

/* Bitfield definition for register: LATCH0_TIME_NE */
/*
 * TIME (RW)
 *
 * System time at the negative edge of the
 * Latch0 signal.
 */
#define ESC_LATCH0_TIME_NE_TIME_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_LATCH0_TIME_NE_TIME_SHIFT (0U)
#define ESC_LATCH0_TIME_NE_TIME_SET(x) (((uint64_t)(x) << ESC_LATCH0_TIME_NE_TIME_SHIFT) & ESC_LATCH0_TIME_NE_TIME_MASK)
#define ESC_LATCH0_TIME_NE_TIME_GET(x) (((uint64_t)(x) & ESC_LATCH0_TIME_NE_TIME_MASK) >> ESC_LATCH0_TIME_NE_TIME_SHIFT)

/* Bitfield definition for register: LATCH1_TIME_PE */
/*
 * TIME (RW)
 *
 * System time at the positive edge of the
 * Latch1 signal.
 */
#define ESC_LATCH1_TIME_PE_TIME_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_LATCH1_TIME_PE_TIME_SHIFT (0U)
#define ESC_LATCH1_TIME_PE_TIME_SET(x) (((uint64_t)(x) << ESC_LATCH1_TIME_PE_TIME_SHIFT) & ESC_LATCH1_TIME_PE_TIME_MASK)
#define ESC_LATCH1_TIME_PE_TIME_GET(x) (((uint64_t)(x) & ESC_LATCH1_TIME_PE_TIME_MASK) >> ESC_LATCH1_TIME_PE_TIME_SHIFT)

/* Bitfield definition for register: LATCH1_TIME_NE */
/*
 * TIME (RW)
 *
 * System time at the negative edge of the
 * Latch1 signal.
 */
#define ESC_LATCH1_TIME_NE_TIME_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_LATCH1_TIME_NE_TIME_SHIFT (0U)
#define ESC_LATCH1_TIME_NE_TIME_SET(x) (((uint64_t)(x) << ESC_LATCH1_TIME_NE_TIME_SHIFT) & ESC_LATCH1_TIME_NE_TIME_MASK)
#define ESC_LATCH1_TIME_NE_TIME_GET(x) (((uint64_t)(x) & ESC_LATCH1_TIME_NE_TIME_MASK) >> ESC_LATCH1_TIME_NE_TIME_SHIFT)

/* Bitfield definition for register: ECAT_BUF_CET */
/*
 * TIME (RO)
 *
 * Local time at the beginning of the frame
 * which causes at least one SyncManager to
 * assert an ECAT event
 */
#define ESC_ECAT_BUF_CET_TIME_MASK (0xFFFFFFFFUL)
#define ESC_ECAT_BUF_CET_TIME_SHIFT (0U)
#define ESC_ECAT_BUF_CET_TIME_GET(x) (((uint32_t)(x) & ESC_ECAT_BUF_CET_TIME_MASK) >> ESC_ECAT_BUF_CET_TIME_SHIFT)

/* Bitfield definition for register: PDI_BUF_SET */
/*
 * TIME (RO)
 *
 * Local time when at least one SyncManager
 * asserts a PDI buffer start event
 */
#define ESC_PDI_BUF_SET_TIME_MASK (0xFFFFFFFFUL)
#define ESC_PDI_BUF_SET_TIME_SHIFT (0U)
#define ESC_PDI_BUF_SET_TIME_GET(x) (((uint32_t)(x) & ESC_PDI_BUF_SET_TIME_MASK) >> ESC_PDI_BUF_SET_TIME_SHIFT)

/* Bitfield definition for register: PDI_BUF_CET */
/*
 * TIME (RO)
 *
 * Local time when at least one SyncManager
 * asserts a PDI buffer change event
 */
#define ESC_PDI_BUF_CET_TIME_MASK (0xFFFFFFFFUL)
#define ESC_PDI_BUF_CET_TIME_SHIFT (0U)
#define ESC_PDI_BUF_CET_TIME_GET(x) (((uint32_t)(x) & ESC_PDI_BUF_CET_TIME_MASK) >> ESC_PDI_BUF_CET_TIME_SHIFT)

/* Bitfield definition for register: PID */
/*
 * PID (RO)
 *
 * Product ID
 */
#define ESC_PID_PID_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_PID_PID_SHIFT (0U)
#define ESC_PID_PID_GET(x) (((uint64_t)(x) & ESC_PID_PID_MASK) >> ESC_PID_PID_SHIFT)

/* Bitfield definition for register: VID */
/*
 * VID (RO)
 *
 * Vendor ID:
 * [23-0] Company
 * [31-24] Department
 * NOTE:Test Vendor IDs have [31:28]=0xE
 */
#define ESC_VID_VID_MASK (0xFFFFFFFFUL)
#define ESC_VID_VID_SHIFT (0U)
#define ESC_VID_VID_GET(x) (((uint64_t)(x) & ESC_VID_VID_MASK) >> ESC_VID_VID_SHIFT)

/* Bitfield definition for register: DIO_OUT_DATA */
/*
 * OD (RO)
 *
 * Output Data
 */
#define ESC_DIO_OUT_DATA_OD_MASK (0xFFFFFFFFUL)
#define ESC_DIO_OUT_DATA_OD_SHIFT (0U)
#define ESC_DIO_OUT_DATA_OD_GET(x) (((uint32_t)(x) & ESC_DIO_OUT_DATA_OD_MASK) >> ESC_DIO_OUT_DATA_OD_SHIFT)

/* Bitfield definition for register: GPO */
/*
 * GPOD (RW)
 *
 * General Purpose Output Data
 */
#define ESC_GPO_GPOD_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_GPO_GPOD_SHIFT (0U)
#define ESC_GPO_GPOD_SET(x) (((uint64_t)(x) << ESC_GPO_GPOD_SHIFT) & ESC_GPO_GPOD_MASK)
#define ESC_GPO_GPOD_GET(x) (((uint64_t)(x) & ESC_GPO_GPOD_MASK) >> ESC_GPO_GPOD_SHIFT)

/* Bitfield definition for register: GPI */
/*
 * GPID (RO)
 *
 * General Purpose Input Data
 */
#define ESC_GPI_GPID_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_GPI_GPID_SHIFT (0U)
#define ESC_GPI_GPID_GET(x) (((uint64_t)(x) & ESC_GPI_GPID_MASK) >> ESC_GPI_GPID_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE0 */
/*
 * EXTF (RW)
 *
 * Number of extended feature bits
 */
#define ESC_USER_RAM_BYTE0_EXTF_MASK (0xFFU)
#define ESC_USER_RAM_BYTE0_EXTF_SHIFT (0U)
#define ESC_USER_RAM_BYTE0_EXTF_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE0_EXTF_SHIFT) & ESC_USER_RAM_BYTE0_EXTF_MASK)
#define ESC_USER_RAM_BYTE0_EXTF_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE0_EXTF_MASK) >> ESC_USER_RAM_BYTE0_EXTF_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE1 */
/*
 * PRWO (RW)
 *
 * Physical Read/Write Offset (0x0108:0x0109)
 */
#define ESC_USER_RAM_BYTE1_PRWO_MASK (0x80U)
#define ESC_USER_RAM_BYTE1_PRWO_SHIFT (7U)
#define ESC_USER_RAM_BYTE1_PRWO_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE1_PRWO_SHIFT) & ESC_USER_RAM_BYTE1_PRWO_MASK)
#define ESC_USER_RAM_BYTE1_PRWO_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE1_PRWO_MASK) >> ESC_USER_RAM_BYTE1_PRWO_SHIFT)

