RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_esc_regs.h
/*
 * AEMW (RW)
 *
 * AL Event Mask writable (0x0204:0x0207)
 */
#define ESC_USER_RAM_BYTE1_AEMW_MASK (0x40U)
#define ESC_USER_RAM_BYTE1_AEMW_SHIFT (6U)
#define ESC_USER_RAM_BYTE1_AEMW_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE1_AEMW_SHIFT) & ESC_USER_RAM_BYTE1_AEMW_MASK)
#define ESC_USER_RAM_BYTE1_AEMW_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE1_AEMW_MASK) >> ESC_USER_RAM_BYTE1_AEMW_SHIFT)

/*
 * GPO (RW)
 *
 * General Purpose Outputs (0x0F10:0x0F17)
 */
#define ESC_USER_RAM_BYTE1_GPO_MASK (0x20U)
#define ESC_USER_RAM_BYTE1_GPO_SHIFT (5U)
#define ESC_USER_RAM_BYTE1_GPO_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE1_GPO_SHIFT) & ESC_USER_RAM_BYTE1_GPO_MASK)
#define ESC_USER_RAM_BYTE1_GPO_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE1_GPO_MASK) >> ESC_USER_RAM_BYTE1_GPO_SHIFT)

/*
 * GPI (RW)
 *
 * General Purpose Inputs (0x0F18:0x0F1F)
 */
#define ESC_USER_RAM_BYTE1_GPI_MASK (0x10U)
#define ESC_USER_RAM_BYTE1_GPI_SHIFT (4U)
#define ESC_USER_RAM_BYTE1_GPI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE1_GPI_SHIFT) & ESC_USER_RAM_BYTE1_GPI_MASK)
#define ESC_USER_RAM_BYTE1_GPI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE1_GPI_MASK) >> ESC_USER_RAM_BYTE1_GPI_SHIFT)

/*
 * CSA (RW)
 *
 * Configured Station Alias (0x0012:0x0013)
 */
#define ESC_USER_RAM_BYTE1_CSA_MASK (0x8U)
#define ESC_USER_RAM_BYTE1_CSA_SHIFT (3U)
#define ESC_USER_RAM_BYTE1_CSA_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE1_CSA_SHIFT) & ESC_USER_RAM_BYTE1_CSA_MASK)
#define ESC_USER_RAM_BYTE1_CSA_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE1_CSA_MASK) >> ESC_USER_RAM_BYTE1_CSA_SHIFT)

/*
 * EIM (RW)
 *
 * ECAT Interrupt Mask (0x0200:0x0201)
 */
#define ESC_USER_RAM_BYTE1_EIM_MASK (0x4U)
#define ESC_USER_RAM_BYTE1_EIM_SHIFT (2U)
#define ESC_USER_RAM_BYTE1_EIM_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE1_EIM_SHIFT) & ESC_USER_RAM_BYTE1_EIM_MASK)
#define ESC_USER_RAM_BYTE1_EIM_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE1_EIM_MASK) >> ESC_USER_RAM_BYTE1_EIM_SHIFT)

/*
 * ALSCR (RW)
 *
 * AL Status Code Register (0x0134:0x0135)
 */
#define ESC_USER_RAM_BYTE1_ALSCR_MASK (0x2U)
#define ESC_USER_RAM_BYTE1_ALSCR_SHIFT (1U)
#define ESC_USER_RAM_BYTE1_ALSCR_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE1_ALSCR_SHIFT) & ESC_USER_RAM_BYTE1_ALSCR_MASK)
#define ESC_USER_RAM_BYTE1_ALSCR_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE1_ALSCR_MASK) >> ESC_USER_RAM_BYTE1_ALSCR_SHIFT)

/*
 * EDLCR (RW)
 *
 * Extended DL Control Register (0x0102:0x0103)
 */
#define ESC_USER_RAM_BYTE1_EDLCR_MASK (0x1U)
#define ESC_USER_RAM_BYTE1_EDLCR_SHIFT (0U)
#define ESC_USER_RAM_BYTE1_EDLCR_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE1_EDLCR_SHIFT) & ESC_USER_RAM_BYTE1_EDLCR_MASK)
#define ESC_USER_RAM_BYTE1_EDLCR_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE1_EDLCR_MASK) >> ESC_USER_RAM_BYTE1_EDLCR_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE2 */
/*
 * ESCFG (RW)
 *
 * EEPROM Size configurable (0x0502[7]):
 * 0:EEPROM Size fixed to sizes up to 16 Kbit
 * 1:EEPROM Size configurable
 */
#define ESC_USER_RAM_BYTE2_ESCFG_MASK (0x80U)
#define ESC_USER_RAM_BYTE2_ESCFG_SHIFT (7U)
#define ESC_USER_RAM_BYTE2_ESCFG_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE2_ESCFG_SHIFT) & ESC_USER_RAM_BYTE2_ESCFG_MASK)
#define ESC_USER_RAM_BYTE2_ESCFG_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE2_ESCFG_MASK) >> ESC_USER_RAM_BYTE2_ESCFG_SHIFT)

/*
 * EPUPEC (RW)
 *
 * ECAT Processing Unit/PDI Error Counter
 * (0x030C:0x030D)
 */
#define ESC_USER_RAM_BYTE2_EPUPEC_MASK (0x40U)
#define ESC_USER_RAM_BYTE2_EPUPEC_SHIFT (6U)
#define ESC_USER_RAM_BYTE2_EPUPEC_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE2_EPUPEC_SHIFT) & ESC_USER_RAM_BYTE2_EPUPEC_MASK)
#define ESC_USER_RAM_BYTE2_EPUPEC_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE2_EPUPEC_MASK) >> ESC_USER_RAM_BYTE2_EPUPEC_SHIFT)

/*
 * DCSMET (RW)
 *
 * DC SyncManager Event Times (0x09F0:0x09FF)
 */
#define ESC_USER_RAM_BYTE2_DCSMET_MASK (0x20U)
#define ESC_USER_RAM_BYTE2_DCSMET_SHIFT (5U)
#define ESC_USER_RAM_BYTE2_DCSMET_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE2_DCSMET_SHIFT) & ESC_USER_RAM_BYTE2_DCSMET_MASK)
#define ESC_USER_RAM_BYTE2_DCSMET_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE2_DCSMET_MASK) >> ESC_USER_RAM_BYTE2_DCSMET_SHIFT)

/*
 * RESET (RW)
 *
 * Reset (0x0040:0x0041)
 */
#define ESC_USER_RAM_BYTE2_RESET_MASK (0x8U)
#define ESC_USER_RAM_BYTE2_RESET_SHIFT (3U)
#define ESC_USER_RAM_BYTE2_RESET_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE2_RESET_SHIFT) & ESC_USER_RAM_BYTE2_RESET_MASK)
#define ESC_USER_RAM_BYTE2_RESET_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE2_RESET_MASK) >> ESC_USER_RAM_BYTE2_RESET_SHIFT)

/*
 * WP (RW)
 *
 * Write Protection (0x0020:0x0031)
 */
#define ESC_USER_RAM_BYTE2_WP_MASK (0x4U)
#define ESC_USER_RAM_BYTE2_WP_SHIFT (2U)
#define ESC_USER_RAM_BYTE2_WP_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE2_WP_SHIFT) & ESC_USER_RAM_BYTE2_WP_MASK)
#define ESC_USER_RAM_BYTE2_WP_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE2_WP_MASK) >> ESC_USER_RAM_BYTE2_WP_SHIFT)

/*
 * WDGCNT (RW)
 *
 * Watchdog counters (0x0442:0x0443)
 */
#define ESC_USER_RAM_BYTE2_WDGCNT_MASK (0x2U)
#define ESC_USER_RAM_BYTE2_WDGCNT_SHIFT (1U)
#define ESC_USER_RAM_BYTE2_WDGCNT_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE2_WDGCNT_SHIFT) & ESC_USER_RAM_BYTE2_WDGCNT_MASK)
#define ESC_USER_RAM_BYTE2_WDGCNT_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE2_WDGCNT_MASK) >> ESC_USER_RAM_BYTE2_WDGCNT_SHIFT)

/*
 * WDW (RW)
 *
 * Watchdog divider writable (0x0400:0x0401) and
 * Watchdog PDI (0x0410:0x0411)
 */
#define ESC_USER_RAM_BYTE2_WDW_MASK (0x1U)
#define ESC_USER_RAM_BYTE2_WDW_SHIFT (0U)
#define ESC_USER_RAM_BYTE2_WDW_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE2_WDW_SHIFT) & ESC_USER_RAM_BYTE2_WDW_MASK)
#define ESC_USER_RAM_BYTE2_WDW_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE2_WDW_MASK) >> ESC_USER_RAM_BYTE2_WDW_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE3 */
/*
 * RLED (RW)
 *
 * Run LED (DEV_STATE LED)
 */
#define ESC_USER_RAM_BYTE3_RLED_MASK (0x80U)
#define ESC_USER_RAM_BYTE3_RLED_SHIFT (7U)
#define ESC_USER_RAM_BYTE3_RLED_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE3_RLED_SHIFT) & ESC_USER_RAM_BYTE3_RLED_MASK)
#define ESC_USER_RAM_BYTE3_RLED_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE3_RLED_MASK) >> ESC_USER_RAM_BYTE3_RLED_SHIFT)

