RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_esc_regs.h
/*
 * DCS1D (RW)
 *
 * DC Sync1 disable
 */
#define ESC_USER_RAM_BYTE7_DCS1D_MASK (0x8U)
#define ESC_USER_RAM_BYTE7_DCS1D_SHIFT (3U)
#define ESC_USER_RAM_BYTE7_DCS1D_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE7_DCS1D_SHIFT) & ESC_USER_RAM_BYTE7_DCS1D_MASK)
#define ESC_USER_RAM_BYTE7_DCS1D_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE7_DCS1D_MASK) >> ESC_USER_RAM_BYTE7_DCS1D_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE8 */
/*
 * PPDI (RW)
 *
 * PLB PDI
 */
#define ESC_USER_RAM_BYTE8_PPDI_MASK (0x20U)
#define ESC_USER_RAM_BYTE8_PPDI_SHIFT (5U)
#define ESC_USER_RAM_BYTE8_PPDI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE8_PPDI_SHIFT) & ESC_USER_RAM_BYTE8_PPDI_MASK)
#define ESC_USER_RAM_BYTE8_PPDI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE8_PPDI_MASK) >> ESC_USER_RAM_BYTE8_PPDI_SHIFT)

/*
 * OPDI (RW)
 *
 * OPB PDI
 */
#define ESC_USER_RAM_BYTE8_OPDI_MASK (0x10U)
#define ESC_USER_RAM_BYTE8_OPDI_SHIFT (4U)
#define ESC_USER_RAM_BYTE8_OPDI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE8_OPDI_SHIFT) & ESC_USER_RAM_BYTE8_OPDI_MASK)
#define ESC_USER_RAM_BYTE8_OPDI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE8_OPDI_MASK) >> ESC_USER_RAM_BYTE8_OPDI_SHIFT)

/*
 * APDI (RW)
 *
 * Avalon PDI
 */
#define ESC_USER_RAM_BYTE8_APDI_MASK (0x8U)
#define ESC_USER_RAM_BYTE8_APDI_SHIFT (3U)
#define ESC_USER_RAM_BYTE8_APDI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE8_APDI_SHIFT) & ESC_USER_RAM_BYTE8_APDI_MASK)
#define ESC_USER_RAM_BYTE8_APDI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE8_APDI_MASK) >> ESC_USER_RAM_BYTE8_APDI_SHIFT)

/*
 * PDICEC (RW)
 *
 * PDI clears error counter
 */
#define ESC_USER_RAM_BYTE8_PDICEC_MASK (0x4U)
#define ESC_USER_RAM_BYTE8_PDICEC_SHIFT (2U)
#define ESC_USER_RAM_BYTE8_PDICEC_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE8_PDICEC_SHIFT) & ESC_USER_RAM_BYTE8_PDICEC_MASK)
#define ESC_USER_RAM_BYTE8_PDICEC_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE8_PDICEC_MASK) >> ESC_USER_RAM_BYTE8_PDICEC_SHIFT)

/*
 * DC64 (RW)
 *
 * DC 64 bit
 */
#define ESC_USER_RAM_BYTE8_DC64_MASK (0x1U)
#define ESC_USER_RAM_BYTE8_DC64_SHIFT (0U)
#define ESC_USER_RAM_BYTE8_DC64_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE8_DC64_SHIFT) & ESC_USER_RAM_BYTE8_DC64_MASK)
#define ESC_USER_RAM_BYTE8_DC64_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE8_DC64_MASK) >> ESC_USER_RAM_BYTE8_DC64_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE9 */
/*
 * DR (RW)
 *
 * Direct RESET
 */
#define ESC_USER_RAM_BYTE9_DR_MASK (0x80U)
#define ESC_USER_RAM_BYTE9_DR_SHIFT (7U)
#define ESC_USER_RAM_BYTE9_DR_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE9_DR_SHIFT) & ESC_USER_RAM_BYTE9_DR_MASK)
#define ESC_USER_RAM_BYTE9_DR_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE9_DR_MASK) >> ESC_USER_RAM_BYTE9_DR_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE10 */
/*
 * PDIIR (RW)
 *
 * PDI Information register (0x014E:0x014F)
 */
#define ESC_USER_RAM_BYTE10_PDIIR_MASK (0x80U)
#define ESC_USER_RAM_BYTE10_PDIIR_SHIFT (7U)
#define ESC_USER_RAM_BYTE10_PDIIR_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE10_PDIIR_SHIFT) & ESC_USER_RAM_BYTE10_PDIIR_MASK)
#define ESC_USER_RAM_BYTE10_PDIIR_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE10_PDIIR_MASK) >> ESC_USER_RAM_BYTE10_PDIIR_SHIFT)

/*
 * PDIFA (RW)
 *
 * PDI function acknowledge by PDI write
 */
#define ESC_USER_RAM_BYTE10_PDIFA_MASK (0x40U)
#define ESC_USER_RAM_BYTE10_PDIFA_SHIFT (6U)
#define ESC_USER_RAM_BYTE10_PDIFA_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE10_PDIFA_SHIFT) & ESC_USER_RAM_BYTE10_PDIFA_MASK)
#define ESC_USER_RAM_BYTE10_PDIFA_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE10_PDIFA_MASK) >> ESC_USER_RAM_BYTE10_PDIFA_SHIFT)

/*
 * APDI (RW)
 *
 * AXI PDI
 */
#define ESC_USER_RAM_BYTE10_APDI_MASK (0x8U)
#define ESC_USER_RAM_BYTE10_APDI_SHIFT (3U)
#define ESC_USER_RAM_BYTE10_APDI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE10_APDI_SHIFT) & ESC_USER_RAM_BYTE10_APDI_MASK)
#define ESC_USER_RAM_BYTE10_APDI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE10_APDI_MASK) >> ESC_USER_RAM_BYTE10_APDI_SHIFT)

/*
 * DCL1D (RW)
 *
 * DC Latch1 disable
 */
#define ESC_USER_RAM_BYTE10_DCL1D_MASK (0x4U)
#define ESC_USER_RAM_BYTE10_DCL1D_SHIFT (2U)
#define ESC_USER_RAM_BYTE10_DCL1D_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE10_DCL1D_SHIFT) & ESC_USER_RAM_BYTE10_DCL1D_MASK)
#define ESC_USER_RAM_BYTE10_DCL1D_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE10_DCL1D_MASK) >> ESC_USER_RAM_BYTE10_DCL1D_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE11 */
/*
 * LEDTST (RW)
 *
 * LED test
 */
#define ESC_USER_RAM_BYTE11_LEDTST_MASK (0x8U)
#define ESC_USER_RAM_BYTE11_LEDTST_SHIFT (3U)
#define ESC_USER_RAM_BYTE11_LEDTST_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE11_LEDTST_SHIFT) & ESC_USER_RAM_BYTE11_LEDTST_MASK)
#define ESC_USER_RAM_BYTE11_LEDTST_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE11_LEDTST_MASK) >> ESC_USER_RAM_BYTE11_LEDTST_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE14 */
/*
 * DIOBS (RW)
 *
 * Digital I/O PDI byte size
 */
#define ESC_USER_RAM_BYTE14_DIOBS_MASK (0xC0U)
#define ESC_USER_RAM_BYTE14_DIOBS_SHIFT (6U)
#define ESC_USER_RAM_BYTE14_DIOBS_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE14_DIOBS_SHIFT) & ESC_USER_RAM_BYTE14_DIOBS_MASK)
#define ESC_USER_RAM_BYTE14_DIOBS_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE14_DIOBS_MASK) >> ESC_USER_RAM_BYTE14_DIOBS_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE15 */
/*
 * AUCPDI (RW)
 *
 * Asynchronous µC PDI
 */
#define ESC_USER_RAM_BYTE15_AUCPDI_MASK (0x10U)
#define ESC_USER_RAM_BYTE15_AUCPDI_SHIFT (4U)
#define ESC_USER_RAM_BYTE15_AUCPDI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE15_AUCPDI_SHIFT) & ESC_USER_RAM_BYTE15_AUCPDI_MASK)
#define ESC_USER_RAM_BYTE15_AUCPDI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE15_AUCPDI_MASK) >> ESC_USER_RAM_BYTE15_AUCPDI_SHIFT)

/*
 * SSPDI (RW)
 *
 * SPI Slave PDI
 */
#define ESC_USER_RAM_BYTE15_SSPDI_MASK (0x8U)
#define ESC_USER_RAM_BYTE15_SSPDI_SHIFT (3U)
#define ESC_USER_RAM_BYTE15_SSPDI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE15_SSPDI_SHIFT) & ESC_USER_RAM_BYTE15_SSPDI_MASK)
#define ESC_USER_RAM_BYTE15_SSPDI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE15_SSPDI_MASK) >> ESC_USER_RAM_BYTE15_SSPDI_SHIFT)

